# Terkendala dengan methods/functions di Pandas? Namun terbiasa bermain SQL? tenang! berikut gambaran solusinya, happy learning!!

In [1]:
import pandas as pd
import pandasql as ps

In [2]:
#pip install pandasql

In [3]:
data = pd.read_csv("Mall_Customers.csv")

In [4]:
data

     CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0             1    Male   19                  15                      39
1             2    Male   21                  15                      81
2             3  Female   20                  16                       6
3             4  Female   23                  16                      77
4             5  Female   31                  17                      40
..          ...     ...  ...                 ...                     ...
195         196  Female   35                 120                      79
196         197  Female   45                 126                      28
197         198    Male   32                 126                      74
198         199    Male   32                 137                      18
199         200    Male   30                 137                      83

[200 rows x 5 columns]

In [7]:
ps.sqldf("""

SELECT customerid, gender, age, `Annual Income (k$)`, `Spending Score (1-100)`
FROM data
ORDER BY 1, 2, 3
LIMIT 10
""")

   CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40
5           6  Female   22                  17                      76
6           7  Female   35                  18                       6
7           8  Female   23                  18                      94
8           9    Male   64                  19                       3
9          10  Female   30                  19                      72

In [10]:
ps.sqldf(""" select distinct gender from data """)

   Gender
0    Male
1  Female

In [12]:
ps.sqldf(""" select gender, count(1) jml from data group by gender order by jml desc """)

   Gender  jml
0  Female  112
1    Male   88

In [15]:
ps.sqldf(""" select distinct jenis_kelamin
             from
             (select 
             case 
             when gender = 'Female' then 'Perempuan'
             when gender = 'Male' then 'Lelaki'
             end as jenis_kelamin
             from data)
         """)

  jenis_kelamin
0        Lelaki
1     Perempuan

# selebihnya operasi2 yang biasa dilakukan dapat diaplikasikan, termasuk join dsb... !